var prov_city_array = {
    0:{ provname:"请选择",cities:{0:"请选择"}},
	1:{ provname:"北京市", cities:{0:"请选择",1:"东城区", 2:"西城区", 3:"崇文区", 4:"宣武区", 5:"朝阳区", 6:"丰台区", 7:"石景山区", 8:"海淀区", 9:"门头沟区", 10:"房山区", 11:"通州区", 12:"顺义区", 13:"延庆县", 14:"昌平区", 15:"怀柔区", 16:"密云县", 17:"平谷区", 18:"大兴区", 19:"其它地区"} },
	2:{ provname:"上海市", cities:{0:"请选择",114:"黄浦区", 116:"卢湾区", 117:"徐汇区", 118:"长宁区", 119:"静安区", 120:"普陀区", 121:"闸北区", 122:"虹口区", 123:"杨浦区", 124:"闵行区", 125:"宝山区", 126:"嘉定区", 127:"浦东新区", 128:"金山区", 129:"松江区", 130:"崇明县", 131:"青浦区", 132:"南汇区", 133:"奉贤区", 134:"其它地区"} },
	3:{ provname:"天津市", cities:{0:"请选择",20:"和平区", 21:"河东区", 22:"河西区", 23:"南开区", 24:"河北区", 25:"红桥区", 26:"塘沽区", 27:"大港区", 28:"东丽区", 29:"西青区", 30:"津南区", 31:"北辰区", 32:"蓟县", 33:"宝坻区", 34:"武清区", 35:"宁河县", 36:"静海县", 541:"汉沽区", 37:"其它地区"} },
	4:{ provname:"重庆市", cities:{0:"请选择",327:"渝中区", 328:"大渡口区", 329:"江北区", 330:"沙坪坝区", 331:"九龙坡区", 332:"南岸区", 333:"北碚区", 334:"万盛区", 335:"双桥区", 336:"渝北区", 337:"巴南区", 338:"万州区", 339:"涪陵区", 340:"合川市", 341:"永川市", 342:"江津市", 343:"南川市", 344:"长寿区", 345:"綦江县", 346:"潼南县", 347:"铜梁县", 348:"大足县", 349:"荣昌县", 350:"璧山县", 351:"垫江县", 352:"武隆县", 353:"丰都县", 354:"城口县", 355:"梁平县", 357:"黔江区", 545:"奉节县", 546:"开县", 547:"云阳县", 548:"忠县", 549:"巫溪县", 550:"巫山县", 551:"石柱土家族自治县", 552:"秀山土家族苗族自治县", 553:"酉阳土家族苗族自治县", 554:"彭水苗族土家族自治县", 358:"其它地区"} },
	5:{ provname:"安徽省", cities:{0:"请选择",160:"合肥市", 161:"宿州市", 162:"淮北市", 163:"阜阳市", 164:"蚌埠市", 165:"淮南市", 166:"滁州市", 167:"马鞍山市", 168:"芜湖市", 169:"铜陵市", 170:"安庆市", 171:"黄山市", 172:"六安市", 173:"巢湖市", 174:"池州市", 175:"宣城市", 540:"亳州市", 176:"其它地区"} },
	6:{ provname:"甘肃省", cities:{0:"请选择",427:"兰州市", 428:"嘉峪关市", 429:"金昌市", 430:"白银市", 431:"天水市", 432:"酒泉市", 433:"张掖市", 434:"武威市", 435:"庆阳市", 436:"平凉市", 437:"定西市", 438:"陇南市", 439:"临夏回族自治州", 440:"甘南藏族自治州", 557:"玉门市", 558:"敦煌市", 441:"其它地区"} },
	7:{ provname:"福建省", cities:{0:"请选择",177:"福州市", 178:"南平市", 179:"三明市", 180:"莆田市", 181:"泉州市", 182:"厦门市", 183:"漳州市", 184:"龙岩市", 185:"宁德市", 186:"其它地区"} },
	8:{ provname:"广东省", cities:{0:"请选择",269:"广州市", 270:"清远市", 271:"韶关市", 272:"河源市", 273:"梅州市", 274:"潮州市", 275:"汕头市", 276:"揭阳市", 277:"汕尾市", 278:"惠州市", 279:"东莞市", 280:"深圳市", 281:"珠海市", 282:"中山市", 283:"江门市", 284:"佛山市", 285:"肇庆市", 286:"云浮市", 287:"阳江市", 288:"茂名市", 289:"湛江市", 290:"其它地区"} },
	9:{ provname:"广西壮族自治区", cities:{0:"请选择",291:"南宁市", 292:"桂林市", 293:"柳州市", 294:"梧州市", 295:"贵港市", 296:"玉林市", 297:"钦州市", 298:"北海市", 299:"防城港市", 301:"百色市", 302:"河池市", 304:"贺州市", 542:"崇左市", 543:"凭祥市", 544:"来宾市", 305:"其它地区"} },
	10:{ provname:"贵州省", cities:{0:"请选择",381:"贵阳市", 382:"六盘水市", 383:"遵义市", 384:"毕节地区", 385:"铜仁地区", 386:"安顺市", 387:"黔东南苗族侗族自治州", 388:"黔南布依族苗族自治州", 389:"黔西南布依族苗族自治州", 390:"其它地区"} },
	11:{ provname:"海南省", cities:{0:"请选择",306:"海口市", 307:"三亚市", 308:"琼山市", 309:"文昌市", 310:"琼海市", 311:"万宁市", 313:"东方市", 314:"儋州市", 315:"临高县", 316:"澄迈县", 317:"定安县", 318:"屯昌县", 319:"昌江黎族自治县", 320:"白沙黎族自治县", 321:"琼中黎族苗族自治县", 322:"陵水黎族自治县", 323:"保亭黎族苗族自治县", 324:"乐东黎族自治县", 539:"五指山市", 326:"其它地区"} },
	12:{ provname:"河北省", cities:{0:"请选择",38:"石家庄市", 39:"张家口市", 40:"承德市", 41:"秦皇岛市", 42:"唐山市", 43:"廊坊市", 44:"保定市", 45:"沧州市", 46:"衡水市", 47:"邢台市", 48:"邯郸市", 49:"其它地区"} },
	13:{ provname:"河南省", cities:{0:"请选择",217:"郑州市", 218:"三门峡市", 219:"洛阳市", 220:"焦作市", 221:"新乡市", 222:"鹤壁市", 223:"安阳市", 224:"濮阳市", 225:"开封市", 226:"商丘市", 227:"许昌市", 228:"漯河市", 229:"平顶山市", 230:"南阳市", 231:"信阳市", 232:"济源市", 233:"周口市", 234:"驻马店市", 235:"其它地区"} },
	14:{ provname:"黑龙江省", cities:{0:"请选择",100:"哈尔滨市", 101:"齐齐哈尔市", 102:"黑河市", 103:"大庆市", 104:"伊春市", 105:"鹤岗市", 106:"佳木斯市", 107:"双鸭山市", 108:"七台河市", 109:"鸡西市", 110:"牡丹江市", 111:"绥化地区", 112:"大兴安岭地区", 113:"其它地区"} },
	15:{ provname:"湖北省", cities:{0:"请选择",236:"武汉市", 237:"十堰市", 238:"襄樊市", 239:"荆门市", 240:"孝感市", 241:"黄冈市", 242:"鄂州市", 243:"黄石市", 244:"咸宁市", 245:"荆州市", 246:"宜昌市", 247:"随州市", 248:"仙桃市", 249:"天门市", 250:"潜江市", 251:"神农架林区", 252:"恩施土家族苗族自治州", 253:"其它地区"} },
	16:{ provname:"湖南省", cities:{0:"请选择",254:"长沙市", 255:"张家界市", 256:"常德市", 257:"益阳市", 258:"岳阳市", 259:"株洲市", 260:"湘潭市", 261:"衡阳市", 262:"郴州市", 263:"永州市", 264:"邵阳市", 265:"怀化市", 266:"娄底市", 267:"湘西土家族苗族自治州", 268:"其它地区"} },
	17:{ provname:"吉林省", cities:{0:"请选择",90:"长春市", 91:"白城市", 92:"松原市", 93:"吉林市", 94:"四平市", 95:"辽源市", 96:"通化市", 97:"白山市", 98:"延边朝鲜族自治州", 99:"其它地区"} },
	18:{ provname:"江苏省", cities:{0:"请选择",135:"南京市", 136:"徐州市", 137:"连云港市", 138:"宿迁市", 139:"淮安市", 140:"盐城市", 141:"扬州市", 142:"泰州市", 143:"南通市", 144:"镇江市", 145:"常州市", 146:"无锡市", 147:"苏州市", 537:"淮安市", 148:"其它地区"} },
	19:{ provname:"江西省", cities:{0:"请选择",187:"南昌市", 188:"九江市", 189:"景德镇市", 190:"鹰潭市", 191:"新余市", 192:"萍乡市", 193:"赣州市", 194:"上饶市", 195:"抚州市", 196:"宜春市", 197:"吉安市", 198:"其它地区"} },
	20:{ provname:"辽宁省", cities:{0:"请选择",75:"沈阳市", 76:"朝阳市", 77:"阜新市", 78:"铁岭市", 79:"抚顺市", 80:"本溪市", 81:"辽阳市", 82:"鞍山市", 83:"丹东市", 84:"大连市", 85:"营口市", 86:"盘锦市", 87:"锦州市", 88:"葫芦岛市", 89:"其它地区"} },
	21:{ provname:"内蒙古自治区", cities:{0:"请选择",62:"呼和浩特市", 63:"包头市", 64:"乌海市", 65:"赤峰市", 66:"呼伦贝尔", 67:"兴安盟", 69:"锡林郭勒盟", 70:"乌兰察布市", 72:"巴彦淖尔市", 73:"阿拉善盟", 555:"鄂尔多斯市", 556:"通辽市", 74:"其它地区"} },
	22:{ provname:"宁夏回族自治区", cities:{0:"请选择",451:"银川市", 452:"石嘴山市", 453:"吴忠市", 454:"固原市", 599:"中卫市",455:"其它地区"} },
	23:{ provname:"青海省", cities:{0:"请选择",442:"西宁市", 443:"海东地区", 444:"海北藏族自治州", 445:"海南藏族自治州", 446:"黄南藏族自治州", 447:"果洛藏族自治州", 448:"玉树藏族自治州", 449:"海西蒙古族藏族自治州", 450:"其它地区"} },
	24:{ provname:"山东省", cities:{0:"请选择",199:"济南市", 200:"聊城市", 201:"德州市", 202:"东营市", 203:"淄博市", 204:"潍坊市", 205:"烟台市", 206:"威海市", 207:"青岛市", 208:"日照市", 209:"临沂市", 210:"枣庄市", 211:"济宁市", 212:"泰安市", 213:"莱芜市", 214:"滨州市", 215:"菏泽市", 216:"其它地区"} },
	25:{ provname:"山西省", cities:{0:"请选择",50:"太原市", 51:"大同市", 52:"朔州市", 53:"阳泉市", 54:"长治市", 55:"晋城市", 56:"忻州市", 57:"吕梁市", 58:"晋中市", 59:"临汾市", 60:"运城市", 61:"其它地区"} },
	26:{ provname:"陕西省", cities:{0:"请选择",416:"西安市", 417:"延安市", 418:"铜川市", 419:"渭南市", 420:"咸阳市", 421:"宝鸡市", 422:"汉中市", 423:"榆林市", 424:"商洛市", 425:"安康市", 426:"其它地区"} },
	27:{ provname:"四川省", cities:{0:"请选择",359:"成都市", 360:"广元市", 361:"绵阳市", 362:"德阳市", 363:"南充市", 364:"广安市", 365:"遂宁市", 366:"内江市", 367:"乐山市", 368:"自贡市", 369:"泸州市", 370:"宜宾市", 371:"攀枝花市", 372:"巴中市", 373:"达州市", 374:"资阳市", 375:"眉山市", 376:"雅安市", 377:"阿坝藏族羌族自治州", 378:"甘孜藏族自治州", 379:"凉山彝族自治州", 380:"其它地区"} },
	28:{ provname:"西藏自治区", cities:{0:"请选择",408:"拉萨市", 409:"那曲地区", 410:"昌都地区", 411:"林芝地区", 412:"山南地区", 413:"日喀则地区", 414:"阿里地区", 415:"其它地区"} },
	29:{ provname:"新疆维吾尔族自治区", cities:{0:"请选择",456:"乌鲁木齐市", 457:"克拉玛依市", 458:"石河子市", 459:"喀什地区", 460:"阿克苏地区", 461:"和田地区", 462:"吐鲁番地区", 463:"哈密地区", 464:"克孜勒苏柯尔克孜自治州", 465:"博尔塔拉蒙古自治州", 466:"昌吉回族自治州", 467:"巴音郭楞蒙古自治州", 468:"伊犁哈萨克自治州", 469:"阿拉尔市", 470:"塔城地区", 471:"阿勒泰地区", 600:"图木舒克市", 601:"五家渠市", 472:"其它地区"} },
	30:{ provname:"云南省", cities:{0:"请选择",391:"昆明市", 392:"曲靖市", 393:"玉溪市", 394:"丽江市", 395:"昭通市", 396:"普洱市", 397:"临沧市", 398:"保山市", 399:"德宏傣族景颇族自治州", 400:"怒江傈傈族自治州", 401:"迪庆藏族自治州", 402:"大理白族自治州", 403:"楚雄彝族自治州", 404:"红河哈尼族彝族自治州", 405:"文山壮族苗族自治州", 406:"西双版纳傣族自治州", 407:"其它地区"} },
	31:{ provname:"浙江省", cities:{0:"请选择",149:"杭州市", 150:"湖州市", 151:"嘉兴市", 152:"舟山市", 153:"宁波市", 154:"绍兴市", 155:"金华市", 156:"台州市", 157:"温州市", 158:"丽水市", 538:"衢州市", 159:"其它地区"} },
	32:{ provname:"香港特别行政区", cities:{0:"请选择",474:"九龙城区", 559:"中西区", 560:"东区", 561:"观塘区", 562:"南区", 563:"深水埗区", 564:"黄大仙区", 565:"湾仔区", 566:"油尖旺区", 567:"离岛区", 568:"葵青区", 569:"北区", 570:"西贡区", 571:"沙田区", 572:"屯门区", 573:"大埔区", 574:"荃湾区", 575:"元朗区", 476:"其它地区"} },
	33:{ provname:"澳门特别行政区", cities:{0:"请选择",576:"澳门半岛", 577:"凼仔岛", 578:"路环岛", 478:"其它地区"} },
	34:{ provname:"台湾省", cities:{0:"请选择",479:"台北市", 480:"高雄市", 481:"台南市", 482:"台中市", 579:"基隆市", 580:"新竹市", 581:"嘉义市", 582:"台北县", 583:"宜兰县", 584:"新竹县", 585:"桃园县", 586:"苗栗县", 587:"台中县", 588:"彰化县", 589:"南投县", 590:"嘉义县", 591:"云林县", 592:"台南县", 593:"高雄县", 594:"屏东县", 595:"台东县", 596:"花莲县", 597:"澎湖县", 484:"其它地区"} },
	99:{ provname:"--其他国家--", cities:{0:"请选择" , 1001:"美国", 1002:"加拿大", 1003:"阿富汗", 1004:"阿尔巴尼亚", 1005:"阿尔及利亚", 1006:"安道尔共和国", 1007:"安哥拉", 1008:"南极洲", 1009:"阿根廷", 1010:"亚美尼亚", 1011:"澳大利亚", 1012:"奥地利", 1013:"阿塞拜疆", 1014:"巴哈马群岛", 1015:"巴林", 1016:"孟加拉国", 1017:"巴巴多斯", 1018:"白俄罗斯", 1019:"比利时", 1020:"伯利兹", 1021:"贝宁", 1022:"百慕大群岛", 1023:"不丹", 1024:"玻利维亚", 1025:"波黑", 1026:"博茨瓦纳", 1027:"巴西", 1028:"文莱", 1029:"保加利亚", 1030:"布基纳法索", 1031:"布隆迪", 1032:"柬埔寨", 1033:"喀麦隆", 1034:"佛得角", 1035:"中非共和国", 1036:"乍得", 1037:"智利", 1038:"哥伦比亚", 1039:"科摩罗", 1040:"刚果", 1041:"哥斯达黎加", 1042:"克罗地亚", 1043:"古巴", 1044:"塞浦路斯", 1045:"捷克", 1046:"丹麦", 1047:"吉布提", 1048:"多米尼加", 1049:"厄瓜多尔", 1050:"埃及", 1051:"萨尔瓦多", 1052:"赤道几内亚", 1053:"厄立特里亚", 1054:"爱沙尼亚", 1055:"埃塞俄比亚", 1056:"斐济", 1057:"芬兰", 1058:"法国", 1059:"加蓬", 1060:"冈比亚", 1061:"德国", 1062:"加纳", 1063:"希腊", 1064:"格陵兰", 1065:"格林纳达", 1066:"关岛", 1067:"危地马拉", 1068:"几内亚", 1069:"几内亚比绍", 1070:"圭亚那", 1071:"海地", 1072:"洪都拉斯", 1073:"匈牙利", 1074:"冰岛", 1075:"印度", 1076:"印度尼西亚", 1077:"伊朗", 1078:"伊拉克", 1079:"爱尔兰", 1080:"以色列", 1081:"意大利", 1082:"象牙海岸", 1083:"牙买加", 1084:"日本", 1085:"约旦", 1086:"哈萨克斯坦", 1087:"肯尼亚", 1088:"基里巴斯", 1089:"朝鲜", 1090:"韩国", 1091:"科威特", 1092:"老挝", 1093:"拉脱维亚", 1094:"黎巴嫩", 1095:"莱索托", 1096:"利比里亚", 1097:"利比亚", 1098:"列支敦士登", 1099:"立陶宛", 1100:"卢森堡", 1101:"马其顿", 1102:"马达加斯加", 1103:"马拉维", 1104:"马来西亚", 1105:"马尔代夫", 1106:"马里", 1107:"马耳他", 1108:"马绍尔群岛", 1109:"毛里求斯", 1110:"墨西哥", 1111:"摩尔多瓦", 1112:"摩纳哥", 1113:"蒙古", 1114:"摩洛哥", 1115:"莫桑比克", 1116:"缅甸", 1117:"纳米比亚", 1118:"尼泊尔", 1119:"荷兰", 1120:"新西兰", 1121:"尼加拉瓜", 1122:"尼日尔", 1123:"尼日利亚", 1124:"挪威", 1125:"阿曼", 1126:"巴基斯坦", 1127:"帕劳群岛", 1128:"巴拿马", 1129:"巴布亚新几内亚", 1130:"巴拉圭", 1131:"秘鲁", 1132:"菲律宾", 1133:"波兰", 1134:"葡萄牙", 1135:"波多黎各", 1136:"卡塔尔", 1137:"罗马尼亚", 1138:"俄罗斯", 1139:"卢旺达", 1140:"萨摩亚群岛", 1141:"圣马力诺", 1142:"圣多美和普林西比", 1143:"沙特阿拉伯", 1144:"塞内加尔", 1145:"塞舌尔", 1146:"塞拉利昂", 1147:"新加坡", 1148:"斯洛伐克", 1149:"斯洛文尼亚", 1150:"索马里", 1151:"南非", 1152:"西班牙", 1153:"斯里兰卡", 1154:"苏丹", 1155:"苏里南", 1156:"斯威士兰", 1157:"瑞典", 1158:"瑞士", 1159:"叙利亚", 1160:"塔吉克斯坦", 1161:"坦桑尼亚", 1162:"泰国", 1163:"多哥", 1164:"汤加", 1165:"特立尼达和多巴哥", 1166:"突尼斯", 1167:"土耳其", 1168:"土库曼斯坦", 1169:"图瓦卢", 1170:"乌干达", 1171:"乌克兰", 1172:"阿联酋", 1173:"英国", 1174:"乌拉圭", 1175:"乌兹别克斯坦", 1176:"瓦努阿图", 1177:"梵蒂冈", 1178:"委内瑞拉", 1179:"越南", 1180:"也门", 1181:"南斯拉夫", 1182:"扎伊尔", 1183:"赞比亚", 1184:"津巴布韦", 1185:"未知地区" }}
};

var ostr = "";
for (var key in prov_city_array) {
	var cities = prov_city_array[key].cities;
	for (var idx in cities) {
		ostr += idx + ":'" + cities[idx] + "',";
	}
}
eval("var city_array = {" + ostr + "EOA:''}");

function ProvCitySelector(selProv, selCity) {
	this.selProv = selProv;
	this.selCity = selCity;
	this.selProv.Group = this;



	if(window.document.all != null) {
		this.selProv.attachEvent("onchange", ProvCitySelector.Onchange);
	} else {
		this.selProv.addEventListener("change", ProvCitySelector.Onchange, false);
	}

	if(arguments.length == 4) {
		var p = parseInt(arguments[2]);
		var c = parseInt(arguments[3]);
		p = (p<0)?0:p;
		c = (c<0)?0:c;
		this.InitSelector(p, c);
	} else
		this.InitSelector(1, 1);
}

ProvCitySelector.prototype.InitProvSelect = function(prov) {
	for (var key in prov_city_array) {
		var op = window.document.createElement("OPTION");
		op.value = key;
		op.innerHTML = prov_city_array[key].provname;
		if(op.value == prov) op.selected = true;
		this.selProv.appendChild(op);
	}
}

ProvCitySelector.prototype.InitCitySelect = function(city) {
	var prov = parseInt(this.selProv.value);
	var cities = ProvCitySelector.CitiesInProv(prov);
	this.selCity.options.length = 0;
	for (var key in cities) {
		var op = window.document.createElement("OPTION");
		op.value = key;
		op.innerHTML = cities[key];
		if(op.value == city) op.selected = true;
		this.selCity.appendChild(op);
	}
    var that=this;
    this.selCity.onchange=function(){
        try{
		if(this.value&&this.value!="0")
            document.getElementById("area").value=that.selProv.value+"|"+this.value;
        else
            document.getElementById("area").value="";
		}
		catch(e){return;}
    }
}

ProvCitySelector.CitiesInProv = function(prov) {
	return prov_city_array[prov].cities;
}

ProvCitySelector.Onchange = function(e) {
	var selector = window.document.all != null ? e.srcElement : e.target;
	selector.Group.InitCitySelect();
}

ProvCitySelector.prototype.InitSelector = function(prov, city) {
	this.selProv.options.length = 0;
	this.selCity.options.length = 0;
	this.InitProvSelect(prov);
	this.InitCitySelect(city);
}

